{
  "Header": {
    "home": "الرئيسية",
    "About": "حول",
    "Experince": "الخبرات",
    "Projects": "المشاريع",
    "Skills": "المهارات"
  },
  "content": {
    "TitleHome": "مرحباً! أنا يوسف محمد،",
    "ParagraphHomeFirst": "مطور واجهات أمامية حاصل على درجة في علوم الكمبيوتر من",
    "HelwanUniversity": " جامعة حلوان",
    "ParagraphHomeSecond": " حيث تخرجت في مايو 2023 بمعدل تراكمي 3.28 (B+). تركيزي الرئيسي هو على React.js، وقد عملت على مجموعة من المشاريع الكبيرة.",
    "About": "//حول",
    "AboutFirstPargraph": "أنا شغوف بصناعة تجارب مستخدم سلسة وجذابة وأزدهر في متابعة أحدث التقنيات والاتجاهات في الصناعة. قدرتي على التعلم السريع، ومهارات إدارة الوقت القوية، والتزامي بالمسؤولية تجعلني إضافة قيمة لأي فريق تطوير.",
    "AboutSecondPargraph": "أنا دائمًا متحمس لمواجهة تحديات جديدة ومواصلة تطوير مهاراتي. لا تتردد في استكشاف محفظتي والتواصل إذا كنت ترغب في التعاون أو مناقشة الفرص المثيرة!"
  },
  "Experiance": {
    "SmartGateIT": "سمارت جيت لتكنولوجيا المعلومات",
    "4ZSoftware": "4Z للبرمجه",
    "FrontendDeveloper": "مطور واجهات أمامية",
    "september2023": "سبتمبير 2023",
    "PRESENT": "الحاضر",
    "SmartDescription": "مسؤول عن التعاون السلس مع فرق البرمجة الخلفية وواجهات المستخدم، وتقديم حلول React.js مؤثرة للمشاريع الكبيرة. استخدم مهارات التواصل وحل المشكلات القوية لضمان عملية تطوير متكاملة وفعالة، مما ساهم في نجاح المشروع.",
    "June2023": "يونيو 2023",
    "4zDescription": "ساهمت كمطور React.js في 4Z Software، معزّزًا تطبيقات الويب بحلول مبتكرة. تعاونت مع فرق متعددة التخصصات لتقديم تجارب واجهة أمامية ديناميكية وفعالة.",
    "Freelancing": "العمل الحر",
    "FreelancerDeveloper": "مطور مستقل",
    "July2022": "يوليو 2022",
    "FreelancingDescription": "عملت على مشاريع متنوعة بأحجام مختلفة، بدءًا من مواقع صغيرة إلى أنظمة إدارة معقدة. طورت مهارات في تقنيات الواجهة الأمامية والخلفية (بما في ذلك Firebase)، وتصميم تجربة المستخدم، وإدارة المشاريع. قدمت حلولاً عالية الجودة تلبي احتياجات العميل، مع ضمان الوظائف، والأداء، وقابلية التوسع.",
    "IEEE": "IEEE",
    "WorkshopInternship": "تدريب ورشة عمل",
    "October2021": "أكتوبر 2021",
    "January2022": "يناير 2022",
    "IEEEDescription": "أكملت تدريباً وورشة عمل مع IEEE، متخصصاً في تطوير الويب. اكتسبت خبرة عملية في تقنيات الويب الحديثة، وأفضل الممارسات، والمعايير الصناعية. تعاونت في مشاريع حسنت مهاراتي في تطوير الواجهة الأمامية والخلفية، وتصميم واجهة المستخدم/تجربة المستخدم، وتصميم الويب المتجاوب."
  },
  "Projects": {
    "ShowLess": "عرض أقل",
    "ShowMore": "عرض المزيد",
    "Projects": "المشاريع",
    "Restecho": "Restecho",
    "RestechoShortDescription": "Restecho هو نظام إدارة شامل للمطاعم يدمج نظام نقاط البيع (POS)، والتخطيط لموارد المؤسسات (ERP)، والتحكم في المخزون، وإدارة تدفق المطبخ، والمزيد - كل ذلك مصمم لتبسيط العمليات وزيادة الكفاءة. اكتشف الوصف الكامل لتتعرف على كيف يمكن لـ Restecho تحويل إدارة المطاعم!",
    "RestechoLongDiscriptionPointOne": "التطوير التعاوني",
    "RestechoLongDiscriptionPointTwo": "حل شامل",
    "RestechoLongDiscriptionPointthree": "إدارة المخزون",
    "RestechoLongDiscriptionPointFour": "إدارة أوامر الشراء والموردين",
    "RestechoLongDiscriptionPointFive": "تحسين تدفق المطبخ",
    "RestechoLongDiscriptionPointSix": "التكامل مع الهواتف المحمولة",
    "RestechoLongDiscriptionPointSeven": "التحكم في الوصول بناءً على الدور",
    "RestechoLongDiscriptionPointeight": "إدارة العملاء والتقارير",
    "RestechoLongDiscriptionPointnine": "التكامل مع مركز الاتصال",
    "RestechoLongDiscriptionPointTen": "أنظمة المحاسبة والموارد البشرية",
    "RestechoLongDiscriptionPargraphOne": "تم تطوير Restecho كمشروع كبير من قبل فريق يركز على إنشاء نظام إدارة شامل للمطاعم.",
    "RestechoLongDiscriptionPargraphTwo": "يجمع بين نظام نقاط البيع القوي (POS) ونظام تخطيط موارد المؤسسات (ERP) لإدارة جميع جوانب عمليات المطاعم.",
    "RestechoLongDiscriptionPargraphthree": "يدير مستويات المخزون، ويتتبع المنتجات والمكونات، ويتعامل مع نقل المخزون بين المواقع المختلفة، مما يسمح للمسؤولين بنقل العناصر بين المخازن.",
    "RestechoLongDiscriptionPargraphFour": "يبسط عمليات أوامر الشراء ويدير العناصر الخاصة بالموردين، مما يضمن إعادة التوريد الفعالة للمخزون.",
    "RestechoLongDiscriptionPargraphFive": "يتضمن نظام عرض المطبخ (KDS) المتكامل مع نقاط البيع، مما يسمح بالتحديثات في الوقت الفعلي وتخصيص تدفقات العمل في المطبخ لمنتجات معينة.",
    "RestechoLongDiscriptionPargraphSix": "يوفر التوافق مع الهواتف المحمولة لإدارة جميع عمليات المطعم عن بعد، مما يعزز المرونة والتحكم.",
    "RestechoLongDiscriptionPargraphSeven": "يسمح للمسؤولين الكبار بإضافة مسؤولين جدد بامتيازات محددة، مثل الوصول إلى المخزون، لضمان الإدارة الآمنة والفعالة.",
    "RestechoLongDiscriptionPargrapheight": "يتميز بقدرات إدارة شاملة للعملاء وإعداد تقارير مفصلة، مما يوفر رؤى حول العمليات ويساعد على تحسين جودة الخدمة.",
    "RestechoLongDiscriptionPargraphnine": "يدعم مركز اتصال للتعامل مع استفسارات العملاء والطلبات، مما يحسن خدمة العملاء والكفاءة التشغيلية.",
    "RestechoLongDiscriptionPargraphTen": "يتضمن أنظمة محاسبة وإدارة موارد بشرية قوية، مصممة لتلبية الاحتياجات المالية والشخصية للمطاعم وفروعها.",
    "RestechoSummeryDiscreption": "تم تصميم Restecho ليكون حلاً قابلاً للتوسع، وقابلاً للتكيف مع المطاعم من جميع الأحجام، مع وظائف تبسط العمليات، وتحسن كفاءة المطبخ، وتزيد من تحسين الإدارة الشاملة.",

    "MAGNA": "MAGNA",
    "MAGNAshortDescription": "MAGNA هو مشروعي للتخرج - لوحة تحكم نظام مراقبة المرضى التي توفر للمسؤولين تقارير في الوقت الفعلي، وتحديثات حول حالة المرضى، وأدوات لإدارة الأطباء والممرضات. اكتشف المزيد حول كيف يعزز MAGNA إدارة الرعاية الصحية في الوصف الكامل!",
    "MAGNALongDiscriptionPointONE": "نظرة عامة على المشروع",
    "MAGNALongDiscriptionPointTwo": "لوحة تحكم المسؤول",
    "MAGNALongDiscriptionPointThree": "إدارة الأطباء والممرضات",
    "MAGNALongDiscriptionPointFour": "التكامل مع تطبيق الهاتف المحمول",
    "MAGNALongDiscriptionPointFive": "تعيين المرضى ومراقبتهم",
    "MAGNALongDiscriptionPointSIX": "للوصول إلى لوحة التحكم، قم بتسجيل الدخول باستخدام البريد الإلكتروني admin5@test.com وكلمة المرور 123456",

    "MAGNALongDiscriptionPargraphONE": "كان MAGNA مشروعي للتخرج، حيث حصلت على تقدير A+ من خلال تطوير نظام شامل لمراقبة المرضى من البداية إلى النهاية. عملت على كل شيء بدءًا من تصميم واجهة المستخدم إلى تنفيذ الواجهة الأمامية وتكامل الخلفية باستخدام Firebase.",
    "MAGNALongDiscriptionPargraphTwo": "يوفر للمسؤولين تقارير مفصلة وإحصائيات حول حالة المرضى والقياسات الصحية. يمكّن من إنشاء وإدارة حسابات للأطباء والممرضات، مما يسمح لهم بتسجيل الدخول والوصول إلى بيانات المرضى.",
    "MAGNALongDiscriptionPargraphThree": "يسهل إضافة الأطباء والممرضات إلى النظام، مما يتيح الوصول بناءً على الدور. يسمح بتعيين المرضى لأطباء محددين للحصول على رعاية شخصية وأكثر فعالية.",
    "MAGNALongDiscriptionPargraphFour": "لوحة التحكم متكاملة بالكامل مع تطبيق الهاتف المحمول عبر Firebase، مما يوفر تسجيل دخول متزامن وتحديثات بيانات في الوقت الفعلي للأطباء والممرضات. يضمن أن جميع الموظفين الطبيين لديهم معلومات محدثة عن المرضى، يمكن الوصول إليها على كل من أجهزة الكمبيوتر المكتبية والهواتف المحمولة.",
    "MAGNALongDiscriptionPargraphFive": "يمكن للمسؤولين تعيين المرضى لأطباء محددين وعرض المرضى المرتبطين بكل طبيب، مما يبسط إدارة المرضى. يعزز إدارة الرعاية الصحية من خلال توفير رؤية واضحة لتعيينات المرضى والسماح بالمراقبة الفعالة والتحديثات.",
    "MAGNASummeryDiscreption": "تم تصميم MAGNA لإحداث ثورة في إدارة الرعاية الصحية من خلال واجهة مستخدم سهلة الاستخدام وقدرات بيانات في الوقت الفعلي، مما يوفر حلاً مركزيًا لمراقبة صحة المرضى وإدارة الطاقم الطبي بشكل فعال.",

    "AccountingSystem": "نظام المحاسبة",
    "AccountingShortDescription": "نظام المحاسبة هو حل برمجي شامل تم تطويره بالتعاون مع فريق محاسبة لتنفيذ جميع المبادئ المحاسبية الرئيسية. اكتشف المزيد في الوصف الكامل لمعرفة كيف يدعم الإدارة المالية الفعالة!",
    "AccountingLongDiscriptionPointONE": "نظرة عامة على المشروع",
    "AccountingLongDiscriptionPointTwo": "تطوير تعاوني",
    "AccountingLongDiscriptionPointThree": "ميزات محاسبية شاملة",
    "AccountingLongDiscriptionPointFour": "إدارة المستخدم والأدوار",
    "AccountingLongDiscriptionPointFive": "الحسابات والمعاملات",
    "AccountingLongDiscriptionPointsix": "تطبيق في العالم الواقعي",
    "AccountingLongDiscriptionPargraphONE": "تعاونت مع فريق لتطوير نظام محاسبة متكامل يدمج جميع المبادئ المحاسبية الأساسية في منصة موحدة. كان دوري يتضمن العمل بشكل وثيق مع المحاسبين ومدير المحاسبة لفهم وتطبيق المفاهيم المحاسبية المعقدة.",
    "AccountingLongDiscriptionPargraphTwo": "عملت مع فريق تطوير مخصص لبناء النظام من البداية، مع التأكد من أنه يلبي احتياجات الشركات الصغيرة والكبيرة على حد سواء. تعاونت بشكل وثيق مع فريق محاسبة لفهم تفاصيل المبادئ المحاسبية، مما يضمن أن يكون البرنامج دقيقًا وسهل الاستخدام.",
    "AccountingLongDiscriptionPargraphThree": "يتضمن النظام جميع الوظائف المحاسبية الرئيسية، مثل إدارة دفتر الأستاذ، وإعداد التقارير المالية، ومطابقة الحسابات. يدعم أدوار مستخدم متعددة، مثل المحاسبين والمديرين، كل منها مع أذونات محددة وضوابط وصول للحفاظ على سلامة البيانات وأمانها.",
    "AccountingLongDiscriptionPargraphFour": "يوفر نظامًا قويًا لإدارة الأدوار يسمح بإنشاء أدوار مستخدم متنوعة مع مستويات وصول مخصصة. يضمن حماية البيانات المالية الحساسة مع السماح للمحاسبين والمديرين بأداء واجباتهم بفعالية.",
    "AccountingLongDiscriptionPargraphFive": "يتضمن ميزات شاملة لإدارة الحسابات والمعاملات، بما في ذلك القدرة على إنشاء وتحرير وحذف الحسابات حسب الحاجة. يسهل التسجيل الدقيق وتتبع جميع المعاملات المالية، مع الالتزام بالممارسات المحاسبية القياسية.",
    "AccountingLongDiscriptionPargraphSix": "تم تصميم النظام ليكون مرنًا وقابلاً للتوسع، مما يجعله مناسبًا لمجموعة واسعة من الشركات ذات الاحتياجات المحاسبية المتنوعة. يوفر واجهة مستخدم سهلة الاستخدام تبسط المهام المحاسبية المعقدة، مما يجعلها في متناول حتى المستخدمين الذين لديهم معرفة محدودة بالمحاسبة.",
    "AccountingSummeryDiscreption": "نظام المحاسبة هو أداة قوية لإدارة العمليات المالية، تم تطويرها بفهم عميق للمبادئ المحاسبية لضمان تلبية احتياجات المحاسبين المحترفين ومديري الأعمال على حد سواء.",

    "HRSystem": "نظام الموارد البشرية",
    "HRShortDescription": "نظام الموارد البشرية هو حل برمجي شامل تم تطويره برؤى من محترفي الموارد البشرية ليشمل جميع المبادئ الأساسية لإدارة الموارد البشرية. استكشف الوصف الكامل لترى كيف يُسهّل عمليات الموارد البشرية ويعزز إدارة القوى العاملة!",
    "HRLongDiscriptionPointONE": "نظرة عامة على المشروع",
    "HRLongDiscriptionPointTwo": "التطوير التعاوني",
    "HRLongDiscriptionPointThree": "إدارة الموارد البشرية الشاملة",
    "HRLongDiscriptionPointFour": "الأدوار والصلاحيات للمستخدمين",
    "HRLongDiscriptionPointFive": "إدارة دورة حياة الموظف",
    "HRLongDiscriptionPointSix": "التقارير والتحليلات",
    "HRLongDiscriptionPointSeven": "التكامل والقابلية للتوسع",
    "HRLongDiscriptionPargraphONE": "تم تطوير نظام الموارد البشرية بالتعاون الوثيق مع فريق الموارد البشرية ومدير الموارد البشرية لفهم وتطبيق المبادئ الأساسية لإدارة الموارد البشرية داخل منصة رقمية.",
    "HRLongDiscriptionPargraphTwo": "عملت بشكل وثيق مع محترفي الموارد البشرية لجمع المتطلبات التفصيلية وفهم العمليات المختلفة للموارد البشرية، مما يضمن أن يكون النظام مخصصًا لتلبية الاحتياجات الحقيقية. تم التعاون مع مدير الموارد البشرية لتطبيق السياسات والإجراءات الخاصة بالموارد البشرية بدقة، وتحويلها إلى وظائف برمجية فعالة.",
    "HRLongDiscriptionPargraphThree": "يشمل النظام جميع الوظائف الأساسية للموارد البشرية، بما في ذلك إدارة الموظفين، تتبع الحضور، معالجة الرواتب، وتقييم الأداء. يسمح لفرق الموارد البشرية بإدارة عمليات التوظيف والتأهيل وتسجيل الموظفين بكفاءة.",
    "HRLongDiscriptionPargraphFour": "يدعم أدوار مستخدمين متعددة مع صلاحيات محددة، مما يسمح بالوصول المخصص إلى أجزاء مختلفة من نظام الموارد البشرية، مثل المديرين وضباط الموارد البشرية والموظفين. يضمن التعامل الآمن مع بيانات الموظفين الحساسة مع تمكين مستويات مختلفة من الوصول بناءً على الأدوار.",
    "HRLongDiscriptionPargraphFive": "يسهل إدارة دورة حياة الموظف بالكامل، من التوظيف والتأهيل إلى إدارة الأداء وإنهاء الخدمة. يشمل ميزات لإدارة طلبات الإجازة، وتتبع الحضور، ومراقبة أداء الموظفين.",
    "HRLongDiscriptionPargraphSix": "يوفر تقارير وتحليلات مفصلة حول مختلف مؤشرات الموارد البشرية، مثل معدلات دوران الموظفين، وأنماط الحضور، وتقييمات الأداء. يساعد مديري الموارد البشرية في اتخاذ قرارات مستنيرة لتحسين إدارة القوى العاملة وفعالية المنظمة.",
    "HRLongDiscriptionPargraphSeven": "مصمم ليتكامل بسلاسة مع الأنظمة الأخرى للأعمال، مثل الرواتب والمحاسبة، مما يضمن نهجاً متماسكاً في إدارة وظائف الموارد البشرية. قابل للتوسع لاستيعاب الأعمال ذات الأحجام المختلفة، من الشركات الناشئة الصغيرة إلى الشركات الكبيرة.",
    "HRSummeryDiscreption": "تم تصميم نظام الموارد البشرية لتسهيل عمليات الموارد البشرية وتعزيز إدارة القوى العاملة من خلال دمج أفضل الممارسات في الصناعة وتقديم واجهة سهلة الاستخدام لمتخصصي الموارد البشرية.",
    "NiyatClinic": "عيادة نيات",
    "NiyatShortDescription": "تم تطوير نظامين متكاملين: نموذج حجز لعيادة نيات، يتيح للعملاء حجز المواعيد في عدة فروع، ولوحة تحكم إدارية لإدارة العملاء، وعرض التقارير، وتتبع الأداء التسويقي. اكتشف كيف تعمل هذه الأنظمة معًا لتعزيز إدارة العيادة في الوصف الكامل!",
    "NiyatLongDiscriptionPointONE": "نظرة عامة على المشروع",
    "NiyatLongDiscriptionPointTwo": "نموذج الحجز",
    "NiyatLongDiscriptionPointThree": "لوحة التحكم الإدارية",
    "NiyatLongDiscriptionPointFour": "إدارة التسويق",
    "NiyatLongDiscriptionPointFive": "وظائف النظام المتكامل",
    "NiyatLongDiscriptionPointSix": "القابلية للتوسع والمرونة",
    "NiyatLongDiscriptionPargraphONE": "شمل هذا المشروع تطوير نظامين مترابطين لعيادة نيات في المملكة العربية السعودية: نموذج حجز للعملاء ولوحة تحكم إدارية للمسؤولين، كل منهما يخدم وظائف مميزة ولكنها متكاملة.",
    "NiyatLongDiscriptionPargraphTwo": "مصمم لتمكين العملاء من حجز المواعيد بسهولة في عيادة نيات عبر عدة فروع وتخصصات. يتيح النموذج للعملاء إدخال تفاصيلهم الشخصية، واختيار الفرع والمنطقة المرغوبة، وتقديم طلب الحجز. بعد الإرسال، يتم دمج بيانات النموذج بسلاسة مع لوحة التحكم الإدارية، مما يضمن تدفق البيانات بسلاسة بين النظامين.",
    "NiyatLongDiscriptionPargraphThree": "يوفر واجهة شاملة للمسؤولين عن العيادة لإدارة حجوزات العملاء والوصول إلى إحصاءات وتقارير مفصلة. تتضمن أدوات تقارير قوية تمكن المسؤولين من عرض وتنزيل تقارير عن فئات العملاء، أداء الفروع، والمزيد.",
    "NiyatLongDiscriptionPargraphFour": "يمكن للمسؤولين إضافة مسوقين إلى النظام، مع تخصيص رابط إحالة فريد لكل مسوق لترويج خدمات العيادة. تتابع لوحة التحكم أداء المسوقين من خلال مراقبة عدد الحجوزات التي تمت عبر روابط الإحالة الخاصة بهم، وتقوم بحساب أرباحهم تلقائيًا. هذه الميزة تحفز المسوقين على جذب المزيد من العملاء إلى العيادة، مما يزيد من المشاركة العامة ونمو الأعمال.",
    "NiyatLongDiscriptionPargraphFive": "تم دمج النظامين بشكل كامل لتوفير تجربة سلسة لكل من العملاء الذين يحجزون المواعيد والمسؤولين الذين يديرون عمليات العيادة. يمكن للمسؤولين عرض جميع الحجوزات، وإدارة معلومات العملاء، والإشراف على الجهود التسويقية من واجهة مستخدم واحدة وسهلة الاستخدام. يضمن التزامن الفوري للبيانات أن تكون جميع المعلومات محدثة ومتاحة عبر كلا النظامين.",
    "NiyatLongDiscriptionPargraphSix": "مصمم لاستيعاب عدة فروع وتخصصات، مما يجعله حلاً متعدد الاستخدامات لتلبية احتياجات عيادة نيات المتنوعة. تتيح بنية النظام القابلة للتوسع نموه مع العيادة، مما يضيف ميزات ووظائف جديدة حسب الحاجة.",
    "NiyatSummeryDiscreption": "تعمل هذه الأنظمة المتكاملة على تبسيط عملية الحجز وتعزيز الكفاءة الإدارية، مما يوفر حلاً شاملاً لإدارة عمليات العيادة وجهود التسويق بفعالية.",

    "playGroundMangmentSystem": "نظام إدارة الملاعب",
    "PlayGroundShortDescription": "نظام إدارة الملاعب هو حل شامل متكامل مع تطبيق جوال للمستخدمين لحجز ودفع مقابل حجز الملاعب. يوفر لوحة تحكم إدارية مفصلة لإدارة العملاء والحجوزات، مع ميزات متقدمة للمشرفين العامين لمراقبة عدة ملاعب وتوليد تقارير مفيدة. استكشف الوصف الكامل لترى كيف يبسط هذا النظام إدارة الملاعب!",
    "PlayGroundLongDiscriptionPointONE": "نظرة عامة على المشروع",
    "PlayGroundLongDiscriptionPointTwo": "تطبيق الجوال للمستخدم",
    "PlayGroundLongDiscriptionPointThree": "لوحة التحكم الإدارية",
    "PlayGroundLongDiscriptionPointFour": "قدرات المشرف العام",
    "PlayGroundLongDiscriptionPointFive": "إدارة الفئات والإحصائيات",
    "PlayGroundLongDiscriptionPointSix": "التكامل والقابلية للتوسع",
    "PlayGroundLongDiscriptionPointSeven": "الأمان المحسن وإدارة المستخدم",
    "PlayLongDiscriptionPargraphONE": "نظام إدارة الملاعب هو حل متكامل بالكامل يهدف إلى تبسيط إدارة منشآت الملاعب. يتضمن تطبيق جوال للمستخدمين لحجز الملاعب ولوحة تحكم قوية للمشرفين لمتابعة العمليات.",
    "PlayLongDiscriptionPargraphTwo": "يتكامل مع تطبيق جوال سهل الاستخدام يتيح للعملاء تصفح الملاعب المتاحة وإجراء الحجوزات وإتمام الدفعات عبر الإنترنت. يضمن تجربة مستخدم سلسة من خلال توفير تحديثات فورية حول التوافر وتسهيل عمليات الحجز والدفع.",
    "PlayLongDiscriptionPargraphThree": "يوفر واجهة مركزية للمشرفين على الملاعب لإدارة جميع جوانب عمليات الملاعب، بما في ذلك معلومات العملاء والحجوزات. يسمح للمشرفين بمشاهدة قوائم مفصلة لجميع العملاء وحجوزاتهم، مما يوفر رؤى حول أنماط الاستخدام وسلوك العملاء.",
    "PlayLongDiscriptionPargraphFour": "لدى المشرفين العامين صلاحيات معززة تمكنهم من إدارة عدة ملاعب من لوحة تحكم واحدة. يمكنهم إنشاء مشرفين فرديين لكل ملعب، مما يمنحهم الوصول إلى بيانات العملاء والحجوزات الخاصة بملعبهم. يمكن للمشرفين العامين أيضًا تصنيف الملاعب، مما يوفر مرونة في تنظيم وإدارة منشآت متعددة.",
    "PlayLongDiscriptionPargraphFive": "يمكن للمشرفين العامين إنشاء وإدارة فئات لأنواع مختلفة من الملاعب، مثل ملاعب الرياضة ومناطق الأطفال والمزيد. يوفر النظام إحصائيات وتقارير شاملة عن جميع الملاعب، مما يساعد المشرفين العامين على اتخاذ قرارات مستنيرة لتحسين العمليات وتعزيز رضا المستخدمين.",
    "PlayLongDiscriptionPargraphSix": "النظام متكامل بالكامل مع تطبيق الجوال، مما يضمن تزامن جميع البيانات في الوقت الفعلي لكل من المستخدمين والمشرفين. مصمم ليكون قابلاً للتوسع، يمكن للنظام بسهولة استيعاب المزيد من الملاعب والمستخدمين، مما يجعله مناسبًا لتوسيع العمليات.",
    "PlayLongDiscriptionPargraphSeven": "يطبق ميزات قوية لإدارة المستخدمين للتحكم في الوصول وضمان أمان البيانات. لدى المشرفين والمشرفين العامين أدوار وصلاحيات مميزة، مما يحمي بيانات العملاء والعمليات الحساسة مع تمكين الإدارة الفعالة.",
    "PlayGroundSummeryDiscreption": "يبسط نظام إدارة الملاعب عمليات الملاعب من خلال مزيج قوي من الأدوات المستندة إلى الجوال والويب، مما يوفر تجربة سلسة لكل من المستخدمين والمسؤولين.",

    "AlAzharUniversity": "جامعة الأزهر",
    "AlAzharMangmentSystem": "نظام إدارة التعلم بجامعة الأزهر هو منصة شاملة تهدف إلى تعزيز عملية التعلم للطلاب والمعلمين والدكاترة وموظفي الإدارة. النظام حاليًا قيد التطوير ولم يتم إصداره بعد، وكان دوري في هذا المشروع يركز على قيادة الفريق بدلاً من التطوير المباشر. يتيح النظام لكل مستخدم الوصول إلى لوحة تحكم مخصصة لإدارة أدوارهم بفعالية. اكتشف المزيد عن هذا النظام التعليمي التحويلي في الوصف الكامل!",
    "AlAzharLongDiscriptionPointONE": "نظرة عامة على المشروع",
    "AlAzharLongDiscriptionPointTwo": "الدور والمسؤوليات",
    "AlAzharLongDiscriptionPointThree": "لوحة تحكم الطالب",
    "AlAzharLongDiscriptionPointFour": "لوحة تحكم المعلم والدكتور",
    "AlAzharLongDiscriptionPointFive": "الإدارة والإشراف",
    "AlAzharLongDiscriptionPointSix": "الأدوار والصلاحيات للمستخدم",
    "AlAzharLongDiscriptionPointSeven": "إدارة المحتوى",
    "AlAzharLongDiscriptionPointeight": "ميزات إدارة التعلم",
    "AlAzharLongDiscriptionPargraphONE": "نظام إدارة التعلم بجامعة الأزهر (LMS) هو منصة قوية مصممة لدعم وتعزيز عملية التعلم للطلاب والمعلمين والدكاترة والموظفين الإداريين داخل الجامعة. تم تطوير هذا المشروع بهدف إنشاء بيئة تعليمية رقمية شاملة.",
    "AlAzharLongDiscriptionPargraphTwo": "عملت كقائد فريق، حيث قمت بتوجيه فريق متنوع من المطورين والمصممين خلال عملية التطوير بأكملها. امتدت مسؤولياتي إلى ما بعد التطوير لتشمل إدارة المشاريع، وتنسيق الجهود عبر الأقسام المختلفة، وضمان التوافق مع الأهداف التعليمية للجامعة.",
    "AlAzharLongDiscriptionPargraphThree": "يمكن للطلاب تسجيل الدخول إلى لوحة التحكم الشخصية الخاصة بهم للوصول إلى الدرجات ومواد الدورة والميزات الأخرى لـ LMS، مما يوفر مركزًا مركزيًا لجميع احتياجاتهم التعليمية. يوفر النظام أدوات للطلاب لتتبع تقدمهم، وتقديم المهام، والانخراط في وحدات التعلم التفاعلية.",
    "AlAzharLongDiscriptionPargraphFour": "لدى المعلمين والدكاترة لوحات تحكم مخصصة خاصة بهم حيث يمكنهم إدارة الدورات، وتحميل المواد، وتصحيح المهام، والتواصل مع الطلاب. تدعم المنصة مجموعة من الأنشطة التعليمية، من المحاضرات التقليدية إلى الجلسات التفاعلية، مما يعزز التجربة التعليمية بشكل عام.",
    "AlAzharLongDiscriptionPargraphFive": "يتضمن النظام دورًا لمديري الموقع الذين يشرفون على محتوى المنصة ويضمنون بقائه محدثًا وذا صلة. يمتلك المسؤولون أدوات قوية لإدارة حسابات المستخدمين وتعيين الأدوار ومراقبة أداء النظام، مما يضمن التشغيل السلس والأمان.",
    "AlAzharLongDiscriptionPargraphSix": "تدعم المنصة أدوار متعددة للمستخدمين، بما في ذلك الطلاب والمعلمين والدكاترة والمديرين، ولكل منهم صلاحيات محددة تتناسب مع احتياجاتهم. يضمن هذا الهيكل الهرمي أن المستخدمين لديهم إمكانية الوصول فقط إلى الميزات والبيانات اللازمة لأدوارهم، مما يعزز الأمان وسهولة الاستخدام.",
    "AlAzharLongDiscriptionPargraphSeven": "يمكن لمديري الموقع إدارة المحتوى بكفاءة عبر المنصة، مما يضمن أن جميع المواد التعليمية سهلة الوصول ومنظمة بشكل جيد. يدعم النظام تحديثات المحتوى الديناميكية، مما يسمح بالتحسين المستمر والتكيف مع استراتيجيات وتقنيات التعليم الجديدة.",
    "AlAzharLongDiscriptionPargraphEight": "يتضمن وظائف أساسية لنظام إدارة التعلم مثل إدارة الدورات وتتبع الطلاب ووحدات التعلم التفاعلية، وكلها مصممة لتحسين العملية التعليمية. يوفر أدوات تحليل وتقارير مفصلة، مما يمكّن المعلمين من مراقبة أداء الطلاب وتكييف استراتيجيات التدريس وفقًا لذلك.",
    "AlAzharSummeryDiscreption": "يعكس مشروع نظام إدارة التعلم بجامعة الأزهر تقدمًا كبيرًا في التعليم الرقمي، حيث يقدم منصة شاملة وسهلة الاستخدام لإدارة عملية التعلم على جميع المستويات داخل الجامعة.",

    "moviesCinema":"سينما الأفلام",
    "moviesCinemaShortDescription":"هذا مشروع جانبي يقوم بجلب بيانات عن الأفلام، مما يسمح للمستخدمين بالبحث عن الأفلام بالاسم وعرض معلومات مفصلة عن كل فيلم.",
    "moviesCinemaPointOne":"نظرة عامة على المشروع",
    "moviesCinemaPointTwo":"الميزات الرئيسية",
    "moviesCinemaPointThree":"التقنيات المستخدمة",
    "moviesCinemaLongDiscriptionPargraphONE":"مشروع جانبي يركز على جلب بيانات الأفلام من واجهة برمجة تطبيقات خارجية، مما يوفر للمستخدمين معلومات مفصلة عن مختلف الأفلام.",
    "moviesCinemaLongDiscriptionPargraphTwo":"البحث عن الأفلام: يمكن للمستخدمين البحث عن الأفلام عن طريق إدخال اسم الفيلم، مما يجعل من السهل العثور على أفلام معينة. تفاصيل الفيلم: بمجرد تحديد فيلم، يمكن للمستخدمين عرض تفاصيل شاملة، بما في ذلك العنوان وتاريخ الإصدار والنوع والملخص والمزيد. واجهة سهلة الاستخدام: مصممة بواجهة مستخدم بسيطة وبديهية لتجربة تصفح سلسة.",
    "moviesCinemaLongDiscriptionPargraphThree":"الواجهة الأمامية: تم التطوير باستخدام React.js لإنشاء مكونات واجهة مستخدم ديناميكية ومتجاوبة. تكامل API: تم التكامل مع واجهة برمجة تطبيقات قاعدة بيانات الأفلام لجلب وعرض بيانات الأفلام.",
    "moviesCinemaSummeryDiscreption":"يعمل هذا المشروع كعرض عملي لاستخدام واجهات برمجة التطبيقات لجلب وعرض البيانات بشكل ديناميكي وبطريقة سهلة الاستخدام.",



    "MenuProject":"مشروع القائمة",
    "MenuShortDescription":"هذا مشروع جانبي لتطبيق قائمة مطعم يسمح للمستخدمين بعرض القائمة، واختيار الأطباق، وتطبيق فلاتر أساسية للعثور على العناصر المطلوبة.",
    "menuPointOne":"نظرة عامة على المشروع",
    "menuPointTwo":"عرض القائمة",
    "menuPointThree":"اختيار الأطباق",
    "menuPointFour":"تصفية أساسية",
    "MenuLongDiscriptionPargraphONE":"مشروع جانبي يهدف إلى إنشاء تطبيق قائمة مطعم بسيط وبديهي حيث يمكن للمستخدمين تصفح الأطباق المتاحة بسهولة واختيارها بناءً على تفضيلاتهم.",
    "MenuLongDiscriptionPargraphTwo":"يعرض التطبيق قائمة شاملة من الأطباق، بما في ذلك المقبلات والأطباق الرئيسية والحلويات والمشروبات، مع وصف تفصيلي وأسعار لكل عنصر.",
    "MenuLongDiscriptionPargraphThree":"يمكن للمستخدمين اختيار الأطباق التي تهمهم وإضافتها إلى قائمة طلباتهم لتجربة طعام مبسطة.",
    "MenuLongDiscriptionPargraphFour":"تتضمن القائمة خيارات تصفية أساسية، مما يسمح للمستخدمين بتضييق اختياراتهم بناءً على فئات مثل نوع المطبخ أو التفضيلات الغذائية أو نطاق الأسعار.",
    "MenuSummery":"يوفر تطبيق قائمة المطعم هذا حلاً بسيطًا للمستخدمين لاستكشاف مجموعة متنوعة من الأطباق، واختيار المفضلة لديهم، وتطبيق الفلاتر لتحسين البحث. إنه أداة مثالية لتحسين تجربة الطعام، مع توفير واجهة سهلة الاستخدام تجعل التنقل في القائمة سهلاً وممتعًا.",



    "EverlaneStore":"متجر إيفرلين",
    "EverlaneStoreShortDescription":"متجر إيفرلين هو مشروع جانبي حيث صممت موقع تجارة إلكترونية بدقة بكسل باستخدام Figma، مع التركيز على واجهة مستخدم نظيفة وعصرية لتحسين تجربة التسوق.",
    "EverlaneStorePointOne":"نظرة عامة على المشروع",
    "EverlaneStorePointTwo":"تصميم دقيق البكسل",
    "EverlaneStorePointThree":"واجهة مستخدم عصرية",
    "EverlaneStorePointFour":"تصميم استجابة",
    "EverlaneStorePointFive":"تصميم موجه للمستخدم",
    "EverlaneStoreLongDiscriptionPargraphONE":"متجر إيفرلين هو مشروع جانبي يهدف إلى إنشاء موقع تجارة إلكترونية جذاب بصريًا وسهل الاستخدام. تم تصميم الموقع باستخدام Figma لضمان دقة البكسل ومظهر مصقول.",
    "EverlaneStoreLongDiscriptionPargraphTwo":"تم استخدام Figma لتصميم كل جانب من جوانب الموقع بدقة، مما يضمن أن كل عنصر يتماشى بشكل مثالي ويحافظ على معيار عالٍ من الجودة البصرية.",
    "EverlaneStoreLongDiscriptionPargraphThree":"تركيز على إنشاء واجهة مستخدم نظيفة ومعاصرة تعزز تجربة التسوق من خلال جعل التنقل بديهيًا وجذابًا من الناحية الجمالية.",
    "EverlaneStoreLongDiscriptionPargraphFour":"تم تصميم الموقع بواجهة استجابة لضمان أن يظهر المتجر بشكل رائع ويعمل بسلاسة عبر مختلف الأجهزة، بما في ذلك أجهزة الكمبيوتر المكتبية والأجهزة اللوحية والهواتف المحمولة.",
    "EverlaneStoreLongDiscriptionPargraphFive":"تأكيدًا على تجربة المستخدم من خلال دمج ميزات سهلة الاستخدام مثل تصفية المنتجات، ووظيفة البحث، وعملية الدفع المبسطة.",
    "EverlaneStoreSummary":"يُظهر مشروع متجر إيفرلين الالتزام بإنشاء منصة تجارة إلكترونية عالية الجودة مع التركيز على تصميم دقيق البكسل وجمالية عصرية. من خلال الاستفادة من Figma للتصميم الدقيق ودمج الميزات الموجهة للمستخدم، يعرض هذا المشروع المهارات في إنشاء تجارب تسوق عبر الإنترنت جذابة وفعالة.",

    "HangmanGame":"لعبة الشنق",
    "HangmanGameShortDescription":"هو مشروع جانبي تم تطويره باستخدام React.js و TypeScript و Vite و Tailwind CSS. يتميز بلعبة تخمين الكلمات الكلاسيكية مع تصميم عصري ومتجاوب.",
    "HangmanGamePointOne":"نظرة عامة على المشروع",
    "HangmanGamePointTwo":"React.js",
    "HangmanGamePointThree":"TypeScript",
    "HangmanGamePointFour":"Vite",
    "HangmanGamePointFive":"Tailwind CSS",
    "HangmanGamePointSix":"أسلوب اللعب الكلاسيكي",
    "HangmanGameLongDiscriptionPargraphONE":"لعبة الشنق هي مشروع جانبي يعيد الحياة إلى لعبة تخمين الكلمات الكلاسيكية باستخدام تقنيات الويب الحديثة. تم بناء المشروع باستخدام React.js و TypeScript و Vite و Tailwind CSS، مما يجمع بين أسلوب اللعب التقليدي وواجهة مستخدم أنيقة ومتجاوبة.",
    "HangmanGameLongDiscriptionPargraphTwo":"استخدمت React.js لبناء واجهة مستخدم ديناميكية وتفاعلية، مع التعامل مع حالة اللعبة وتفاعلات المستخدم بكفاءة.",
    "HangmanGameLongDiscriptionPargraphThree":"تم تنفيذ TypeScript لتحقيق أمان النوع وكشف الأخطاء المحتملة مبكرًا في عملية التطوير، مما يعزز موثوقية وصيانة الشيفرة البرمجية.",
    "HangmanGameLongDiscriptionPargraphFour":"تم استخدام Vite كأداة بناء لتجربة تطوير أسرع وتحسين الأداء، مما يضمن إعادة تحميل سريعة وتجميعًا فعالًا.",
    "HangmanGameLongDiscriptionPargraphFive":"تم استخدام Tailwind CSS لتصميم واجهة عصرية ومتجاوبة بجهد بسيط. لقد مكن الأسلوب القائم على الأدوات من تطوير واجهات المستخدم بسرعة وتنسيق ثابت.",
    "HangmanGameLongDiscriptionPargraphSix":"تضمن ميكانيكيات لعبة الشنق التقليدية حيث يقوم المستخدمون بتخمين الحروف لكشف كلمة مخفية، مع رسم جزء من الشنق مع كل تخمين خاطئ.",
    "HangmanGameSummary":"يعرض مشروع لعبة الشنق مزيجًا من تصميم الألعاب الكلاسيكي وممارسات تطوير الويب الحديثة. من خلال الاستفادة من React.js و TypeScript و Vite و Tailwind CSS، يقدم المشروع تجربة لعب تفاعلية وسلسة مع تصميم عصري ومتجاوب."


  }
}
